H1steria/hx-esp32-cam-fpv/components/air/main.cpp
//#include <Arduino.h>
#include <algorithm>

#include "esp_camera.h"
//#include "EEPROM.h"
#include "esp_log.h"
#include "nvs_flash.h"
#include "esp_event.h"
#include "esp_wifi.h"
//#include <driver/adc.h>
//#include "esp_adc_cal.h"
#include "esp_wifi_types.h"
#include "driver/sdmmc_host.h"
#include "driver/sdmmc_defs.h"
#include "sdmmc_cmd.h"
#include "esp_vfs_fat.h"
//#include "esp_wifi_internal.h"
#include "esp_heap_caps.h"
#include "esp_task_wdt.h"
#include "esp_private/wifi.h"
#include "esp_task_wdt.h"
#include "esp_timer.h"
#include "esp_mac.h"
//#include "bt.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "driver/uart.h"
#include <unistd.h>
#include <fcntl.h>
#include "esp_random.h"

#include "fec_codec.h"
#include "packets.h"
#include "safe_printf.h"
#include "structures.h"
#include "crc.h"
#include "driver/gpio.h"
#include "main.h"
#include "queue.h"
#include "circular_buffer.h"

#include "ll_cam.h" // cam_obj_t defination, used in camera_data_available

#include "wifi.h"
#include "nvs_args.h"

#include "osd.h"
#include "msp.h"
#include "avi.h"

#include "jpeg_parser.h"
#include "util.h"

#include "hx_mavlink_parser.h"

#include "i2c.h"
#include "report.h"

static int s_stats_last_tp = -10000;
static int s_last_osd_packet_tp = -10000;
static int s_last_config_packet_tp = -10000;
// static int64_t s_last_report_packet_tp = -5000;

#define MJPEG_PATTERN_SIZE 512 

/////////////////////////////////////////////////////////////////////////

static size_t s_video_frame_data_size = 0;
static uint32_t s_video_frame_index = 0;
static uint8_t s_video_part_index = 0;
static bool s_video_frame_started = false;
static size_t s_video_full_frame_size = 0;
static uint8_t s_osdUpdateCounter = 0;
static bool s_lastByte_ff = false;

static int s_actual_capture_fps = 0;
static int s_actual_capture_fps_expected = 0;

static int s_quality = 20;
static float s_quality_framesize_K1 = 0; //startup from minimum quality to decrease pressure
static float s_quality_framesize_K2 = 1;
static float s_quality_framesize_K3 = 1;
static int s_max_frame_size = 0;
static int s_sharpness = 20;

static int64_t s_video_last_sent_tp = esp_timer_get_time();
static int64_t s_video_target_frame_dt = 0;
static uint8_t s_max_wlan_outgoing_queue_usage = 0;
static uint8_t s_min_wlan_outgoing_queue_usage_seen = 0;

static int64_t s_last_seen_config_packet = esp_timer_get_time();;

static int64_t s_restart_time = 0;
static int64_t s_wifi_ovf_time = 0;

extern WIFI_Rate s_wlan_rate;

bool SDError = false;
uint16_t SDTotalSpaceGB16 = 0;
uint16_t SDFreeSpaceGB16 = 0;
static uint8_t cam_ovf_count = 0;
static float s_camera_temperature = 0;

int32_t s_dbg;
uint16_t s_framesCounter = 0;

static bool s_initialized = false;

uint16_t s_air_device_id;
uint16_t s_connected_gs_device_id = 0;

static int64_t s_accept_connection_timeout_ms = 0;

/////////////////////////////////////////////////////////////////////////

int s_uart_verbose = 1;

#define LOG(...) do { if (s_uart_verbose > 0) SAFE_PRINTF(__VA_ARGS__); } while (false) 

/////////////////////////////////////////////////////////////////////////

sdmmc_card_t* card = nullptr;

static bool s_air_record = false;

static bool s_camera_stopped = false;
static bool s_camera_stopped_requested = false;

static uint64_t s_shouldRestartRecording;

HXMavlinkParser mavlinkParserIn(true);

//=============================================================================================
//=============================================================================================
#ifdef GPIO_CONTROL_PIN
static bool s_gpio_control_state = false;
#endif

//=============================================================================================
//=============================================================================================
void initialize_gpio_control_pin()
{
#ifdef GPIO_CONTROL_PIN
    gpio_config_t io_conf;
    // io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.pin_bit_mask = 1ULL << GPIO_CONTROL_PIN;
    io_conf.mode = GPIO_MODE_OUTPUT;
    // io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    // io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&io_conf);
    
    gpio_set_level(GPIO_CONTROL_PIN, 0); // Start with GPIO off
    s_gpio_control_state = false;
    LOG("GPIO control initialized on pin %d, state: OFF\n", GPIO_CONTROL_PIN);
#endif
}

//=============================================================================================
void set_gpio_control_pin(bool enabled)
{
#ifdef GPIO_CONTROL_PIN
    gpio_set_level(GPIO_CONTROL_PIN, enabled ? 1 : 0);
    s_gpio_control_state = enabled;
    LOG("GPIO control pin %d set to %s\n", GPIO_CONTROL_PIN, enabled ? "HIGH" : "LOW");
#endif
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR uint64_t micros()
{
    return esp_timer_get_time();
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR uint64_t millis()
{
    return esp_timer_get_time() / 1000ULL;
}

//=============================================================================================
//=============================================================================================

static bool s_recv_ground2air_packet = false;

SemaphoreHandle_t s_serial_mux = xSemaphoreCreateBinary();

auto _init_result2 = []() -> bool
{
  xSemaphoreGive(s_serial_mux);
  return true;
}();

//=============================================================================================
//=============================================================================================
IRAM_ATTR void packet_received_cb(void* buf, wifi_promiscuous_pkt_type_t type)
{
    if (type == WIFI_PKT_DATA)
    {
        //LOG("data packet\n");
    }
    else if (type == WIFI_PKT_MGMT)
    {
        //LOG("management packet\n");
        s_stats.inRejectedPacketCounter++;
        return;
    }
    else if (type == WIFI_PKT_MISC)
    {
        //LOG("misc packet\n");
        s_stats.inRejectedPacketCounter++;
        return;
    }
    else if (type == WIFI_PKT_CTRL)
    {
        //LOG("misc packet\n");
        s_stats.inRejectedPacketCounter++;
        return;
    }

    wifi_promiscuous_pkt_t *pkt = reinterpret_cast<wifi_promiscuous_pkt_t*>(buf);

    if (pkt->rx_ctrl.channel != s_ground2air_config_packet.dataChannel.wifi_channel)
    {
        //LOG("Packet received on wrong channel: %d, expected: %d\n", pkt->rx_ctrl.channel, s_ground2air_config_packet.dataChannel.wifi_channel);
        s_stats.inRejectedPacketCounter++;
        return;
    }    

    uint16_t len = pkt->rx_ctrl.sig_len;
    //s_stats.wlan_data_received += len;
    //s_stats.wlan_data_sent += 1;

    if (len <= WLAN_IEEE_HEADER_SIZE)
    {
        LOG("WLAN receive header error");
        s_stats.wlan_error_count++;
        return;
    }

    //LOG("Recv %d bytes\n", len);
    //LOG("Channel: %d\n", (int)pkt->rx_ctrl.channel);

