H1steria/hx-esp32-cam-fpv/components/air/main.cpp
    //uint8_t broadcast_mac[] = { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF };
    //LOG("MAC: %02x:%02x:%02x:%02x:%02x:%02x\n", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    uint8_t *data = pkt->payload;
    if (memcmp(data + 10, WLAN_IEEE_HEADER_GROUND2AIR + 10, 6) != 0)
    {
        //here we filter also AIR2GROUND packets from other air devices on the same channel
        s_stats.inRejectedPacketCounter++;
        return;
    }

    data += WLAN_IEEE_HEADER_SIZE;
    len -= WLAN_IEEE_HEADER_SIZE; //skip the 802.11 header

    if (len >= 4) 
    {
        len -= 4;
    } 
    else 
    {
        // Packet is too small after removing header and potential FCS
        //LOG("WLAN payload error - packet too small after header removal (%d bytes)\n", len);
        s_stats.wlan_error_count++;
        return;
    }

    size_t size = std::min<size_t>(len, WLAN_MAX_PAYLOAD_SIZE);

    auto res = s_fec_decoder.packetFilter.filter_packet( data, size );
    if ( res != PacketFilter::PacketFilterResult::Pass)
    {
        s_stats.inRejectedPacketCounter++;
        return;
    }

    s_stats.inPacketCounter++;
    s_stats.rssiDbm = -pkt->rx_ctrl.rssi;
    s_stats.noiseFloorDbm = -pkt->rx_ctrl.noise_floor;

    s_fec_decoder.lock();
    if (!s_fec_decoder.decode_data(data, size, false))
    {
        s_stats.wlan_received_packets_dropped++;
    }
    s_fec_decoder.unlock();

    s_stats.wlan_data_received += len;
}

//=============================================================================================
//=============================================================================================
__attribute__((optimize("Os")))
IRAM_ATTR bool processSetting(const char* valueName, int fromValue, int toValue, const char *nvsName )
{
    if ( fromValue != toValue )
    {
        LOG("%s changed from %d to %d\n", valueName, fromValue, toValue );
        if ( !!nvsName ) 
        {
            nvs_args_set(nvsName, (uint32_t)toValue);
        }
        return true;
    }
    return false;
}

//=============================================================================================
//=============================================================================================
//process settings not related to camera sensor setup
static void handle_ground2air_config_packetEx1(Ground2Air_Config_Packet& src)
{
    s_recv_ground2air_packet = true;
    s_accept_connection_timeout_ms = 0;

    int64_t t = esp_timer_get_time();
    s_last_seen_config_packet = t;
    
    Ground2Air_Config_Packet& dst = s_ground2air_config_packet;

    if ( processSetting( "Wifi rate", (int)dst.dataChannel.wifi_rate, (int)src.dataChannel.wifi_rate, "rate") )
    {
        ESP_ERROR_CHECK(set_wifi_fixed_rate(src.dataChannel.wifi_rate));
    }
    
    if ( processSetting( "Wifi power", dst.dataChannel.wifi_power, src.dataChannel.wifi_power, NULL ) )
    {
        ESP_ERROR_CHECK(set_wlan_power_dBm(src.dataChannel.wifi_power));
    }

    if ( processSetting( "FEC codec N", dst.dataChannel.fec_codec_n, src.dataChannel.fec_codec_n, "fec_n") )
    {
        s_fec_encoder.switch_n( src.dataChannel.fec_codec_n );
    }
    
    if ( processSetting( "Wifi channel", dst.dataChannel.wifi_channel, src.dataChannel.wifi_channel, "channel" ) )
    {
        ESP_ERROR_CHECK(esp_wifi_set_channel((int)src.dataChannel.wifi_channel, WIFI_SECOND_CHAN_NONE));
    }

    if ( processSetting( "Target FPS", dst.camera.fps_limit, src.camera.fps_limit, NULL) )
    {
        if (src.camera.fps_limit == 0)
            s_video_target_frame_dt = 0;
        else
            s_video_target_frame_dt = 1000000 / src.camera.fps_limit;
    }

    processSetting( "AutostartRecord", dst.dataChannel.autostartRecord, src.dataChannel.autostartRecord, "autostartRecord" );

    processSetting( "CameraStopChannel", dst.dataChannel.cameraStopChannel, src.dataChannel.cameraStopChannel, "cameraStopCH" );

    processSetting( "mavlink2mspRC",  dst.dataChannel.mavlink2mspRC, src.dataChannel.mavlink2mspRC, "mavlink2mspRC" );

    if ( s_restart_time == 0 )
    {
        if ( dst.dataChannel.air_record_btn != src.dataChannel.air_record_btn )
        {
            s_air_record = !s_air_record;
            //dst.dataChannel.air_record_btn = src.dataChannel.air_record_btn;
        }
    }

    dst = src;
}

//=============================================================================================
//=============================================================================================
//process settings related to camera sensor setup
void handle_ground2air_config_packetEx2(bool forceCameraSettings)
{
    Ground2Air_Config_Packet& src = s_ground2air_config_packet;
    Ground2Air_Config_Packet& dst = s_ground2air_config_packet2;

    sensor_t* s = esp_camera_sensor_get();

#ifdef SENSOR_OV5640
    //on ov5640, aec2 is not aec dsp but "night vision" mode which decimate framerate dynamically
    src.camera.aec2 = false;
#endif

    bool resolutionChanged = (dst.camera.resolution != src.camera.resolution);
    bool ov2640HighFPSChanged = (src.camera.ov2640HighFPS != dst.camera.ov2640HighFPS );
    bool ov5640HighFPSChanged = (src.camera.ov5640HighFPS != dst.camera.ov5640HighFPS );
    if ( forceCameraSettings || resolutionChanged || ov2640HighFPSChanged || ov5640HighFPSChanged )
    {
        s_shouldRestartRecording =  esp_timer_get_time() + 1000000;
        LOG("Camera resolution changed from %d to %d\n", (int)dst.camera.resolution, (int)src.camera.resolution);

#ifdef SENSOR_OV5640
        s->set_colorbar(s, src.camera.ov5640HighFPS?1:0);
#else
        if ( src.camera.ov2640HighFPS && 
            ((src.camera.resolution == Resolution::VGA) ||
            (src.camera.resolution == Resolution::VGA16) ||
            (src.camera.resolution == Resolution::SVGA16)) 
            )
        {
            s->set_xclk( s, LEDC_TIMER_0, 16 );
        }
        else
        {
            s->set_xclk( s, LEDC_TIMER_0, 12 );
        }
#endif

        switch (src.camera.resolution)
        {
            case Resolution::QVGA: s->set_framesize(s, FRAMESIZE_QVGA); break;
            case Resolution::CIF: s->set_framesize(s, FRAMESIZE_CIF); break;
            case Resolution::HVGA: s->set_framesize(s, FRAMESIZE_HVGA); break;
            case Resolution::VGA: s->set_framesize(s, FRAMESIZE_VGA); break;

            case Resolution::VGA16:
#ifdef SENSOR_OV5640
                s->set_framesize(s, FRAMESIZE_P_3MP); //640x360
#else
                s->set_res_raw(s, 1/*OV2640_MODE_SVGA*/,0,0,0, 0, 72, 800, 600-144, 800,600-144,false,false);   //800x456x29.5? fps
                
#endif
            break;

            case Resolution::SVGA: s->set_framesize(s, FRAMESIZE_SVGA); break;

            case Resolution::SVGA16:
#ifdef SENSOR_OV5640
                //s->set_res_raw(s, 0, 0, 2623, 1951, 32, 16, 2844, 1968, 800, 600, true, true);  //attempt for 800x600
                //s->set_res_raw(s, 0, 240, 2623, 1711, 32, 16, 2844, 1488, 800, 450, true, true); //attempt for 800x450

                //s->set_pll(s, false, 26, 1, 1, false, 3, true, 4);  - root2x and pre_div are swapped due to incompatible signatures!
                //s->set_pll(s, false, 25, 1, false, 1, 3, true, 4); 

                //waning: LOGxxx should be commented out in ov5640.c otherwise there will be stack overflow in camtask
                s->set_framesize(s, FRAMESIZE_P_HD); //800x456
#else
                //s->set_framesize(s, FRAMESIZE_P_HD);  800x448 13 fps
                s->set_res_raw(s, 1/*OV2640_MODE_SVGA*/,0,0,0, 0, 72, 800, 600-144, 800,600-144,false,false);   //800x456 13 fps
#endif
            break;

            case Resolution::XGA: s->set_framesize(s, FRAMESIZE_XGA); break; //1024x768

