H1steria/hx-esp32-cam-fpv/components/air/main.cpp
            case Resolution::XGA16:  //1024x576
#ifdef SENSOR_OV5640
                s->set_framesize(s, FRAMESIZE_P_FHD);
#else
                s->set_res_raw(s, 0/*OV2640_MODE_UXGA*/,0,0,0, 0, 150, 1600, 1200-300, 1024, 576, false, false);   //1024x576 13 fps
                
#endif
            break;
            case Resolution::SXGA: s->set_framesize(s, FRAMESIZE_SXGA); break;
            case Resolution::HD: s->set_framesize(s, FRAMESIZE_HD); break;
            case Resolution::UXGA: s->set_framesize(s, FRAMESIZE_UXGA); break;

            case Resolution::COUNT:
            break;

        }

        if ( resolutionChanged)
        {
            nvs_args_set("resolution", (uint32_t)src.camera.resolution);
        }
        if ( ov2640HighFPSChanged)
        {
            nvs_args_set( "ov2640hfps", src.camera.ov2640HighFPS?1:0 );
        }
        if ( ov5640HighFPSChanged)
        {
            nvs_args_set( "ov5640hfps", src.camera.ov5640HighFPS?1:0 );
        }
    }

#define APPLY(n1, n2, type) \
    if (forceCameraSettings || (dst.camera.n1 != src.camera.n1)) \
    { \
        LOG("Camera " #n1 " from %d to %d\n", (int)dst.camera.n1, (int)src.camera.n1); \
        s->set_##n2(s, (type)src.camera.n1); \
    }

#define SAVE(n) \
    if (dst.camera.n != src.camera.n) \
    { \
        nvs_args_set(#n, (uint32_t)src.camera.n); \
    }

    if ( src.camera.quality != 0 )
    {
        APPLY(quality, quality, int);
        s_quality = src.camera.quality;
    }
    else
    {
        if ( forceCameraSettings )
        {
            s->set_quality(s, 20); 
        }
    }

    if ( dst.camera.agc != src.camera.agc)
    {
        //reapply agc gain if agc changed
        forceCameraSettings = true;
    }

    if ( dst.camera.aec != src.camera.aec)
    {
        //reapply aec value if aec changed
        forceCameraSettings = true;
    }

    SAVE(brightness)
    APPLY(brightness, brightness, int)

    SAVE(contrast)
    APPLY(contrast, contrast, int)

    SAVE(saturation)
    APPLY(saturation, saturation, int)

    SAVE(sharpness)
    if ( s_quality < 50 )
    {
        APPLY(sharpness, sharpness, int);
        s_sharpness = src.camera.sharpness;
    }
    APPLY(denoise, denoise, int);

#ifdef SENSOR_OV5640
    //gainceiling for ov5640 is range 0...3ff
    if (forceCameraSettings || (dst.camera.gainceiling != src.camera.gainceiling)) 
    { 
        LOG("Camera gainceiling from %d to %d\n", (int)dst.camera.gainceiling, (int)src.camera.gainceiling); 
        //s->set_gainceiling(s, (gainceiling_t)(2 << src.camera.gainceiling));
        //do not limit gainceiling on OV5640. Contrary to OV2640, it does good images with large gain ceiling, without enormous noise in dark scenes.
        s->set_gainceiling(s, (gainceiling_t)(0x3ff));
    }
#else
    APPLY(gainceiling, gainceiling, gainceiling_t);
#endif

    APPLY(awb, whitebal, int);
    APPLY(awb_gain, awb_gain, int);
    APPLY(wb_mode, wb_mode, int);
    APPLY(agc, gain_ctrl, int);
    APPLY(agc_gain, agc_gain, int);
    APPLY(aec, exposure_ctrl, int);
    APPLY(aec_value, aec_value, int);
    APPLY(aec2, aec2, int);

    SAVE(ae_level);
    APPLY(ae_level, ae_level, int);

    APPLY(hmirror, hmirror, int);
    
    if ( dst.camera.vflip != src.camera.vflip )
    {
        nvs_args_set( "vflip", src.camera.vflip?1:0 );
    }
    APPLY(vflip, vflip, int);

    APPLY(special_effect, special_effect, int);
    APPLY(dcw, dcw, int);
    APPLY(bpc, bpc, int);
    APPLY(wpc, wpc, int);
    APPLY(raw_gma, raw_gma, int);
    APPLY(lenc, lenc, int);
#undef APPLY
#undef SAVE

    dst = src;
}

//===========================================================================================
//===========================================================================================
__attribute__((optimize("Os")))
IRAM_ATTR static void acceptConnectionWithGS( uint16_t gsDeviceId )
{
    s_connected_gs_device_id = gsDeviceId;
    s_fec_encoder.packetFilter.set_packet_header_data( s_air_device_id, s_connected_gs_device_id );
    s_fec_decoder.packetFilter.set_packet_filtering( s_connected_gs_device_id, s_air_device_id );

    LOG("Accepting connection to GS device ID: 0x%04x\n", s_connected_gs_device_id );

    s_accept_connection_timeout_ms = millis() + 3000;
}

//===========================================================================================
//===========================================================================================
static void unpairGS()
{
    s_connected_gs_device_id = 0;
    s_fec_encoder.packetFilter.set_packet_header_data( s_air_device_id, 0 );
    s_fec_decoder.packetFilter.set_packet_filtering( 0, 0 );

    LOG("Unpair from GS\n" );

    s_accept_connection_timeout_ms = 0;
}

//===========================================================================================
//===========================================================================================
static void handle_ground2air_config_packet(Ground2Air_Config_Packet& src)
{
    if ( s_connected_gs_device_id == 0 ) 
    {
        if ( src.airDeviceId == s_air_device_id )
        {
            //accept connection with GS. This GS was connected to this camera before. 
            //Camera rebooted?
            acceptConnectionWithGS( src.gsDeviceId );
        }
        else
        {
            return;
        }
    }

    //handle settings not related to camera sensor setup.
    //camera sensor settings are processed in camera_data_available() callback
    handle_ground2air_config_packetEx1(src);
}

//===========================================================================================
//===========================================================================================
IRAM_ATTR static void handle_ground2air_connect_packet(Ground2Air_Config_Packet& src)
{
    if ( s_connected_gs_device_id == 0 )
    {
        acceptConnectionWithGS( src.gsDeviceId );
    }
}

static void init_camera();

//===========================================================================================
//===========================================================================================
__attribute__((optimize("Os")))
IRAM_ATTR static void handle_ground2air_control_packet(Ground2Air_Control_Packet& src)
{
    // Handle movement commands and retransmit via I2C
    if (s_restart_time == 0)
    {
        switch (src.command)
        {
            case I2C_CMD_FLASH: // Flash
                set_gpio_control_pin(!s_gpio_control_state);
                LOG("Flash toggled to %s\n", s_gpio_control_state ? "ON" : "OFF");
                break;
            case I2C_CMD_JOYSTICK_MOVE: // Joystick movement
                send_i2c_command(I2C_CMD_JOYSTICK_MOVE, src.joystick_x, src.joystick_y);
                LOG("Joystick move command sent via I2C: x=%d, y=%d\n", src.joystick_x, src.joystick_y);
                break;
            case I2C_CMD_NONE: // Stop all movement
                send_i2c_command(I2C_CMD_NONE, 0, 0);
                LOG("Stop command sent via I2C\n");
                break;
            default:
                LOG("Unknown command received: %d\n", src.command);
                break;
        }
    }
}

//===========================================================================================
//===========================================================================================
// __attribute__((optimize("Os")))
// IRAM_ATTR static void handle_ground2air_data_packet(Ground2Air_Data_Packet& src)
// {
// }

//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_video_packet(bool last)
{
    s_stats.video_data += s_video_frame_data_size;

    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true);

    if(!packet_data)
    {
        LOG("no data buf!\n");
    }

    Air2Ground_Video_Packet& packet = *(Air2Ground_Video_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::Video;
    packet.resolution = s_ground2air_config_packet.camera.resolution;
    packet.frame_index = s_video_frame_index;
    packet.part_index = s_video_part_index;
    packet.last_part = last ? 1 : 0;
    packet.size = s_video_frame_data_size + sizeof(Air2Ground_Video_Packet);
    packet.pong = s_ground2air_config_packet.ping;
    packet.version = PACKET_VERSION;
    packet.airDeviceId = s_air_device_id;
    packet.gsDeviceId = s_connected_gs_device_id;
    packet.crc = 0;
    packet.crc = crc8(0, &packet, sizeof(Air2Ground_Video_Packet));
    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
    }
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_osd_packet()
{
    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true);

    if(!packet_data)
    {
        LOG("no data buf!\n");
        return ;
    }

    Air2Ground_OSD_Packet& packet = *(Air2Ground_OSD_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::OSD;
    packet.size = sizeof(Air2Ground_OSD_Packet);
    packet.pong = s_ground2air_config_packet.ping;
    packet.version = PACKET_VERSION;
    packet.airDeviceId = s_air_device_id;
    packet.gsDeviceId = s_connected_gs_device_id;
    packet.crc = 0;

    packet.stats.curr_wifi_rate = (uint8_t)s_wlan_rate;

