H1steria/hx-esp32-cam-fpv/components/air/main.cpp
    s_ground2air_config_packet.dataChannel.wifi_channel = (uint16_t)nvs_args_read( "channel", DEFAULT_WIFI_CHANNEL );
    if((s_ground2air_config_packet.dataChannel.wifi_channel < 1)  || (s_ground2air_config_packet.dataChannel.wifi_channel > 13))
    {
        s_ground2air_config_packet.dataChannel.wifi_channel = DEFAULT_WIFI_CHANNEL;
        nvs_args_set("channel", s_ground2air_config_packet.dataChannel.wifi_channel);
    }

    s_ground2air_config_packet.dataChannel.wifi_rate = (WIFI_Rate)nvs_args_read( "rate", -1 );
    if( s_ground2air_config_packet.dataChannel.wifi_rate > WIFI_Rate::RATE_N_72M_MCS7_S )
    {
        s_ground2air_config_packet.dataChannel.wifi_rate = DEFAULT_WIFI_RATE;
        nvs_args_set("rate", (uint32_t)s_ground2air_config_packet.dataChannel.wifi_rate);
    }

    s_ground2air_config_packet.dataChannel.fec_codec_k = (uint8_t)nvs_args_read( "fec_k", 0 );
    s_ground2air_config_packet.dataChannel.fec_codec_n = (uint8_t)nvs_args_read( "fec_n", 0 );

    if( 
        (s_ground2air_config_packet.dataChannel.fec_codec_k == 0) ||
        (s_ground2air_config_packet.dataChannel.fec_codec_k > 12) || 
        (s_ground2air_config_packet.dataChannel.fec_codec_n == 0) ||
        (s_ground2air_config_packet.dataChannel.fec_codec_n > 12) ||
        (s_ground2air_config_packet.dataChannel.fec_codec_k >= s_ground2air_config_packet.dataChannel.fec_codec_n) 
        )
    {
        s_ground2air_config_packet.dataChannel.fec_codec_k = 6;
        s_ground2air_config_packet.dataChannel.fec_codec_n = 8;
        nvs_args_set("fec_k", s_ground2air_config_packet.dataChannel.fec_codec_k);
        nvs_args_set("fec_n", s_ground2air_config_packet.dataChannel.fec_codec_n);
    }

    s_ground2air_config_packet.camera.resolution = (Resolution)nvs_args_read("resolution", (uint32_t)Resolution::SVGA);
    if ( s_ground2air_config_packet.camera.resolution > Resolution::HD  )
    {
        s_ground2air_config_packet.camera.resolution = Resolution::SVGA;
        nvs_args_set("resolution", (uint32_t)s_ground2air_config_packet.camera.resolution);
    }

    s_ground2air_config_packet.camera.brightness = (int8_t)nvs_args_read("brightness", 10);
    if ( ( s_ground2air_config_packet.camera.brightness < -2 ) || ( s_ground2air_config_packet.camera.brightness > 2 ) )
    {
        s_ground2air_config_packet.camera.brightness = 0;
        nvs_args_set("brightness", s_ground2air_config_packet.camera.brightness);
    }

    s_ground2air_config_packet.camera.contrast = (int8_t)nvs_args_read("contrast", 10);
    if ((s_ground2air_config_packet.camera.contrast < -2) || (s_ground2air_config_packet.camera.contrast > 2))
    {
        s_ground2air_config_packet.camera.contrast = 0; // Default contrast
        nvs_args_set("contrast", s_ground2air_config_packet.camera.contrast);
    }

    s_ground2air_config_packet.camera.saturation = (int8_t)nvs_args_read("saturation", 10);
    if ((s_ground2air_config_packet.camera.saturation < -2) || (s_ground2air_config_packet.camera.saturation > 2))
    {
        s_ground2air_config_packet.camera.saturation = 1; // Default saturation
        nvs_args_set("saturation", s_ground2air_config_packet.camera.saturation);
    }

    s_ground2air_config_packet.camera.sharpness = (int8_t)nvs_args_read("sharpness", 10);
    if ((s_ground2air_config_packet.camera.sharpness < -2) || (s_ground2air_config_packet.camera.sharpness > 3))
    {
        s_ground2air_config_packet.camera.sharpness = 0; // Default sharpness
        nvs_args_set("sharpness", s_ground2air_config_packet.camera.sharpness);
    }

    s_ground2air_config_packet.camera.ae_level = (int8_t)nvs_args_read("ae_level", 10);
    if ((s_ground2air_config_packet.camera.ae_level < -2) || (s_ground2air_config_packet.camera.ae_level > 2))
    {
        s_ground2air_config_packet.camera.ae_level = 1; // Default ae_level
        nvs_args_set("ae_level", s_ground2air_config_packet.camera.ae_level);
    }

    s_ground2air_config_packet.camera.vflip = nvs_args_read( "vflip", 0 ) == 1;
    s_ground2air_config_packet.camera.ov2640HighFPS = nvs_args_read( "ov2640hfps", 0 ) == 1;
    s_ground2air_config_packet.camera.ov5640HighFPS = nvs_args_read( "ov5640hfps", 0 ) == 1;

    s_ground2air_config_packet.dataChannel.autostartRecord = nvs_args_read( "autostartRecord", 1 );

    s_ground2air_config_packet.dataChannel.cameraStopChannel = nvs_args_read( "cameraStopCH", 0 );
    if ( s_ground2air_config_packet.dataChannel.cameraStopChannel > 18 )
    {
        s_ground2air_config_packet.dataChannel.cameraStopChannel = 0;
    }

    s_ground2air_config_packet.dataChannel.mavlink2mspRC = nvs_args_read( "mavlink2mspRC", 0 );

    s_ground2air_config_packet2 = s_ground2air_config_packet;
}

//=============================================================================================
//=============================================================================================
extern "C" void app_main()
{
    //esp_task_wdt_init();

    printf("Initializing...\n");

    s_ground2air_data_packet.type = Ground2Air_Header::Type::Telemetry;
    s_ground2air_data_packet.size = sizeof(s_ground2air_data_packet);

    s_ground2air_config_packet.type = Ground2Air_Header::Type::Config;
    s_ground2air_config_packet.size = sizeof(s_ground2air_config_packet);
    s_ground2air_config_packet.dataChannel.wifi_rate = DEFAULT_WIFI_RATE;

    printf("MEMORY at start: \n");
    heap_caps_print_heap_info(MALLOC_CAP_8BIT);
    heap_caps_print_heap_info(MALLOC_CAP_EXEC);

    initialize_gpio_control_pin();
    initialize_i2c();

#ifdef INIT_UART_0
    printf("Init UART0...\n");
    uart_config_t uart_config0 = 
    {
        .baud_rate = 115200,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .rx_flow_ctrl_thresh = 122,
        .source_clk = UART_SCLK_APB,
        .flags = 0
    };  
    ESP_ERROR_CHECK(uart_param_config(UART_NUM_0, &uart_config0) );
    ESP_ERROR_CHECK(uart_driver_install(UART_NUM_0, 512, 256, 0, NULL, 0));
    ESP_ERROR_CHECK(uart_set_pin(UART_NUM_0, TXD0_PIN, RXD0_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE));
#endif

