H1steria/hx-esp32-cam-fpv/components/air/main.cpp
    //reinitialize rec button after configuring uarts
    // initialize_rec_button();

    nvs_args_init();

    readConfig();

    //allocates large continuous Wifi output bufer. Allocate ASAP until memory is not fragmented.
    setup_wifi(s_ground2air_config_packet.dataChannel.wifi_rate, s_ground2air_config_packet.dataChannel.wifi_channel, s_ground2air_config_packet.dataChannel.wifi_power, packet_received_cb);
    s_fec_encoder.packetFilter.set_packet_header_data( s_air_device_id, 0 );

    // if ( !getButtonState() )
    // {
    //allocates 16kb dma buffer. Allocate ASAP before memory is fragmented.
    init_camera();
    // }

    printf("MEMORY Before Loop: \n");
    heap_caps_print_heap_info(MALLOC_CAP_8BIT);
    heap_caps_print_heap_info(MALLOC_CAP_EXEC);

    handle_ground2air_config_packetEx1( s_ground2air_config_packet);
    handle_ground2air_config_packetEx2( true);
    set_ground2air_config_packet_handler(handle_ground2air_config_packet);
    set_ground2air_connect_packet_handler(handle_ground2air_connect_packet);
    // set_ground2air_data_packet_handler(handle_ground2air_data_packet);
    set_ground2air_control_packet_handler(handle_ground2air_control_packet);

    LOG("WIFI channel: %d\n", s_ground2air_config_packet.dataChannel.wifi_channel );

    // temperature_sensor_init();

    s_initialized = true;

    while (true)
    {
        int dt = millis() - s_stats_last_tp;
        if (dt >= 1000)
        {
            s_stats_last_tp = millis();

            s_actual_capture_fps = (int)(s_stats.video_frames)* 1000 / dt;
            s_actual_capture_fps_expected = (int)(s_stats.video_frames_expected)* 1000 / dt;
            s_max_wlan_outgoing_queue_usage = getMaxWlanOutgoingQueueUsage();
            s_min_wlan_outgoing_queue_usage_seen = getMinWlanOutgoingQueueUsageSeen();
            
            s_stats.wlan_error_count += s_fec_wlan_error_count;
            s_fec_wlan_error_count = 0;

            // if (s_uart_verbose > 0 )
            // {
            //     LOG("WLAN S: %d, R: %d, E: %d, F: %d, D: %d, %%: %d...%d || FPS: %d(%d), D: %d || SD D: %d, E: %d || TLM IN: %d OUT: %d\nSK1: %d SK2: %d, SK3: %d, Q: %d s: %d ovf:%d || sbg: %d || AIR: 0x%04x || GS: 0x%04x\n ",
            //         s_stats.wlan_data_sent, s_stats.wlan_data_received, s_stats.wlan_error_count, s_stats.fec_spin_count,
            //         s_stats.wlan_received_packets_dropped, s_min_wlan_outgoing_queue_usage_seen, s_max_wlan_outgoing_queue_usage, 
            //         s_actual_capture_fps, s_actual_capture_fps_expected, s_stats.video_data, s_stats.sd_data, s_stats.sd_drops, 
            //         s_stats.in_telemetry_data, s_stats.out_telemetry_data,
            //         (int)(s_quality_framesize_K1*100),  (int)(s_quality_framesize_K2*100), (int)(s_quality_framesize_K3*100), 
            //         s_quality, (s_stats.camera_frame_size_min + s_stats.camera_frame_size_max)/2, cam_ovf_count, s_dbg,
            //         s_air_device_id, s_connected_gs_device_id);
            // }

            s_max_frame_size = 0;
            s_dbg = 0;

            if ( s_stats.fec_spin_count > 0 )
            {
                s_wifi_ovf_time = esp_timer_get_time();
            }

            s_last_stats = s_stats;
            s_stats = Stats();

            // temperature_sensor_read(&s_camera_temperature);

            if ( s_camera_stopped_requested != s_camera_stopped )
            {
                s_camera_stopped = s_camera_stopped_requested;
                if ( s_camera_stopped )
                {
                    LOG("Camera stopped\n");
                    esp_camera_deinit();
                }
                else
                {
                    LOG("Camera started\n");
                    init_camera();
                }
            }
        }

        dt = millis() - s_last_osd_packet_tp;
        if ( dt > 200 ) 
        {
            s_last_osd_packet_tp = millis();
            
            if ( s_camera_stopped )
            {
                s_fec_encoder.lock();

                if ( !g_osd.isLocked() && (g_osd.isChanged() || (s_osdUpdateCounter == 15)) )
                {
                    send_air2ground_osd_packet();
                    s_osdUpdateCounter = 0;
                }
                else
                {
                    s_osdUpdateCounter++;
                }
                
                s_fec_encoder.unlock();
            }
        }

        if ( s_accept_connection_timeout_ms != 0 ) 
        {
            if ( s_accept_connection_timeout_ms < millis() )
            {
                unpairGS();
            }
        }

        vTaskDelay(100 / portTICK_PERIOD_MS);
        //esp_task_wdt_reset();

        if ((s_restart_time!=0) && ( esp_timer_get_time()>s_restart_time))
        {
            esp_restart();
        }

    }

}

/*
Air receive:
1) packet_received_cb()- called by Wifi library when wifi packet is received
  - feeds data to s_fec_decoder.decode_data(). No data type checking at all.

2) s_fec_decoder.decode_data()
 - allocates item in m_decoder.packet_pool
 - concatenates small packets until mtu size (because wifi packets may be broken to smaller parts by wifi layer)
 - enquees packets into m_decoder.packet_queue

3) decoder_task_proc()  
 - retrives item from m_decoder.packet_queue
 - inserts either in m_decoder.block_packets or m_decoder.block_fec_packets
 - inserts into s_wlan_incoming_queue either received or restored packets
 - signals s_wifi_rx_task

4) s_wifi_rx_task
  - parses packets: Ground2Air_Header::Type::Config, Ground2Air_Header::Type::Data
 

Air send:
1) camera_data_available callback from camera library
 - send_air2ground_video_packet() - passes Air2Ground_Video_Packet to s_fec_encode.
 - flush_encode_packet() - concatenates data until mtu size and passes to m_encoder.packet_queue
 
 2) encoder_task_proc()
  - gathers packets in m_encoder.block_packets
  - calls fec_encode(()
  - add_to_wlan_outgoing_queue() - places encoded packets into s_wlan_outgoing_queue

3) wifi_tx_proc
 - reads s_wlan_outgoing_queue
 - calls esp_wifi_80211_tx()
 
*/
